Repository: ProfesseurOrme/Snow_Tricks
Catalog: translations/messages.*.xlf
Languages: fr

source: Home
fr: Accueil

source: Tricks
fr: Figures

source: Sign in
fr: Se Connecter

source: Sign up
fr: S'enregistrer

source: Log out
fr: Se déconnecter

# Tricks_Create
source: Create a trick
fr: Créer une figure

# Home_Title_Description
source: Welcome to the community site for snowboards enthusiasts
fr: Bienvenue sur le site communautaire des fous de snowboard.

# Footer_Description
source: OpenClassrooms Project 6 - Snow Tricks
fr: Projet 6 OpenClassrooms - SnowTricks

# Meta_Title_Home
source: SnowTricks - The community site for snowboards enthusiasts
fr: SnowTricks - Site Communautaire des fous de snowboard

# Meta_Title_Trick_Edit
source: Editing a trick - Creation
fr: Édition d'une figure - Création

# Form_Label_Name
source: Trick's name
fr: Nom de la figure

# Form_Trick_Name
source: Add a trick name here
fr: Entrez un nom de figure ici.

# Trick_Title_Description
source: Here, you can edit a trick and submit it to the community
fr: Ici, vous pouvez éditer une figure et la soumettre à la communauté

# Trick_Title_Form
source: Edit your trick
fr: Éditez votre figure

# Form_Label_Description
source: Write a description
fr: Entrez une description

# Form_Trick_Category_Placeholder
source: -- Choose the category --
fr: -- Choisissez une famille --

# Form_Label_Category
source: Choose trick's category
fr: Choisissez la catégorie de la figure

# Form_Trick_Submit
source: Submit
fr: Enregistrer

# Form_Label_For_Picture
source: picture
fr: image

# Form_Label_Picture
source: Add some pictures (1 minimum)
fr: Ajoutez des images (minimum 1)

# Form_Label_Video
source: Add some videos (1 minimum)
fr: Ajoutez des vidéos (minimum 1)

# Form_Label_For_Main_Picture
source: picture
fr: image

# Form_Label_Main_Picture
source: Add an illustration picture (jpeg/png, high quality)
fr: Ajouter une image d'illustration (jpeg/png, haute qualité)

# Form_Button_Add_Picture
source: Add a picture
fr: Ajouter une image

# Form_Button_Add_Pictures
source: Add pictures
fr: Ajouter des images

# Form_Button_Add_Video
source: Add a video embed
fr: Ajouter une vidéo

# Form_Trick_Description
source: Add a description for your trick
fr: Ajoutez une description à la figure

# Form_Trick_Video
source: Add video embed
fr: Entrez le lien de la vidéo

# Trick_Subtitle_Form
source: Enter and select the information about the trick (All fields are required !).
fr: Entrez et sélectionnez les informations concernant la figure (Attention, tous les champs sont obligatoires !).

# Trick_Title_Media
source: Choose your medias
fr: Sélectionnez les médias

# Trick_Subtitle_Media
source: Choisissez des photos et des vid√©os sur l'astuce que vous souhaitez soumettre
fr: Choisissez des photos et des vidéos sur la figure que vous souhaitez soumettre

# Form_Label_Main_Pictures
source: Add (at least) one or more pictures of the trick
fr: Ajoutez (au moins) une ou plusieurs images d'illustrations

# Meta_Title_Detail_Trick
source: SnowTricks - Detail : name
fr: SnowTricks - Détail : name

# Trick_Date_Created
source: Created at
fr: Créé le

# Trick_Comment_Submit_Button
source: Send
fr: Envoyer

# Trick_Comment_Placeholder
source: Write your comment here
fr: Écrivez votre commentaire ici

# Trick_Comment_Empty_Message
source: There is no comment available for now. Sign in and get let's fix this !
fr: Aucun commentaire n'a été posté pour le moment. Connecte toi et arrangeons ça !

# Trick_Medias_Title
source: Media gallery
fr: Galerie des médias

# Trick_Medias_Descritpion
source: A selection of pictures and videos related to the trick. Navigate through the carousel and see !
fr: Une sélection d'images et de vidéos en relation avec la figure. Naviguez via le carousel et admirez !

# Trick_Comment_Title
source: React ! Leave your comment
fr: Réagissez ! Laissez votre commentaire

# LogIn_Username_Label_For
source: username
fr: pseudo

# LogIn_Username_Label
source: Username
fr: Pseudo

# LogIn_Password_Label
source: Password
fr: Mot de passe

# LogIn_Remember_me_Label
source: remember me
fr: se souvenir de moi

# LogIn_Remember_me_Checkbox
source: Remember me
fr: Se souvenir de moi

# LogIn_Connection_Button
source: Login
fr: Connexion

# LogIn_Title_Form
source: Login
fr: Se connecter

# SignUp_Title_Form
source: Registration
fr: Création du compte

# SignUp_Username_Label
source: Username
fr: Pseudo

# SignUp_Username_Invalid
source: Username already existing. Please, try another
fr: Identifiant déja existant. Veuillez en choisir un autre

# SignUp_Username_Valid
source: Username valid and available
fr: Identifiant valide et disponible

# SignUp_Password_Label_For
source: password
fr: mot de passe

# SignUp_Password_Label
source: Password
fr: Mot de passe

# SignUp_Button_Create
source: Create an account
fr: Créer le compte

# Reset_Title_Form
source: Reset your password
fr: Réinitialisez votre mot de passe

# Reset_Password_Label_For
source: email
fr: password

# Reset_Password_Label
source: Email
fr: Mot de passe

# Reset_Connection_Button
source: Reset
fr: Réinitialiser

source: Reset Password
fr: Réinitialiser votre mot de passe

# Reset_Password_Error_Email
source: The value of the email field does not match your account email. Please, retry !
fr: La valeur du champ email ne correspond pas à l'email de votre compte. Veuillez réessayer !

# Edit_Icon
source: Edit trick
fr: Éditer la figure

# Delete_Icon
source: Delete trick
fr: Supprimer la figure

# Author_Trick_Label
source: Author
fr: Auteur

# Modal_Delete_Title
source: Confirm your action
fr: Confirmer votre action

# Modal_Delete_Confirmation
source: Do you really want to delete this trick
fr: Voulez vous vraiment supprimer la figure

# Form_Delete_Button_Dismiss
source: Dismiss
fr: Annuler

# Form_Delete_Button_Confirm
source: Confirm
fr: Confirmer

# SignUp_Password_Check_Label
source: Repeat password
fr: Répetez le mot de passe

# SignUp_Password_Check_Placeholder
source: Your password
fr: Confirmez votre mot de passe

# SignUp_Username_Placeholder
source: Your username
fr: Votre nom d'utilisateur

# SignUp_Email_Placeholder
source: Your email
fr: Votre email

# Home_Link_Trick
source: See
fr: Voir

# Trick_Comment_Message
source: View comments
fr: Voir les commentaires

# Trick_Comment_Log
source: You're not registred
fr: Vous n'êtes pas enregistré

# Trick_Comment_Log_Details
source: For leave a comment, please authenticate or register if you are not already registered
fr: Veuillez vous authentifier ou enregistrez vous si vous n'êtes pas déjà inscrit

# SignUp_Picture_Label_For
source: picture
fr: image

# SignUp_Label_Main_Picture
source: Add a profil picture (optional)
fr: Ajouter une photo de profil (optionnel)

# Delete_Comment_Icon
source: Delete this comment
fr: Supprimer ce commentaire

# Moderate_User_Icon
source: Ban this user
fr: Modérer cet utilisateur
